{"meta":{"title":"Berwyn's Blog","subtitle":"生而逐梦，不问归期。","description":null,"author":"Berwyn","url":"https://www.berwyn.cn"},"pages":[{"title":"404 Not Found：该页无法显示","date":"2018-03-04T14:15:12.908Z","updated":"2018-01-13T19:00:47.993Z","comments":false,"path":"/404.html","permalink":"https://www.berwyn.cn//404.html","excerpt":"","text":""},{"title":"书单","date":"2018-03-04T14:15:12.924Z","updated":"2018-01-13T16:45:56.737Z","comments":false,"path":"books/index.html","permalink":"https://www.berwyn.cn/books/index.html","excerpt":"","text":""},{"title":"","date":"2018-03-04T14:15:12.942Z","updated":"2018-01-14T09:08:26.347Z","comments":true,"path":"links/links.json","permalink":"https://www.berwyn.cn/links/links.json","excerpt":"","text":"{\"蝶梦文字游戏\":{\"link\":\"http://www.iwzyx.com/\",\"avatar\":\"/images/favatar/dm.png\",\"desc\":\"沉浸在你的文字世界\"}}"},{"title":"分类","date":"2018-03-04T14:15:12.928Z","updated":"2018-01-13T16:45:56.738Z","comments":false,"path":"categories/index.html","permalink":"https://www.berwyn.cn/categories/index.html","excerpt":"","text":""},{"title":"友情链接","date":"2018-03-04T14:15:12.941Z","updated":"2018-01-15T06:46:12.765Z","comments":true,"path":"links/index.html","permalink":"https://www.berwyn.cn/links/index.html","excerpt":"","text":"蝶梦文字游戏: link: http://www.iwzyx.com/ avatar: /images/favatar/dm.png desc: 沉浸在你的文字世界"},{"title":"标签","date":"2018-03-04T14:15:12.900Z","updated":"2018-01-13T16:45:56.832Z","comments":false,"path":"tags/index.html","permalink":"https://www.berwyn.cn/tags/index.html","excerpt":"","text":""},{"title":"项目","date":"2018-03-04T16:43:44.800Z","updated":"2018-03-04T16:43:44.800Z","comments":true,"path":"repository/index.html","permalink":"https://www.berwyn.cn/repository/index.html","excerpt":"","text":""},{"title":"关于","date":"2018-03-04T16:50:10.665Z","updated":"2018-03-04T16:50:10.665Z","comments":true,"path":"about/index.html","permalink":"https://www.berwyn.cn/about/index.html","excerpt":"","text":"本人兴趣广泛、爱好众多，但都学而不精。 手中常备两本书：《XXX从入门到放弃》、《XXX从卸载到跑路》 这个博客是为了记录生活，偶尔的奇思妙想和吐槽┐(‘～`；)┌ 好吧好吧，只是喜欢吐槽┐(‘～`；)┌。 联系我Gmail：goddoges@Gmail.com 如果评论功能被墙了，不能正常评论的朋友抱歉啦，可以用过电子邮件和我交流。 最后的哔哔叨如果你希望支持本站，留个言让我看见你吧~"}],"posts":[{"title":"一场突如其来的感慨","slug":"一场突如其来的感慨","date":"2018-02-26T11:47:30.000Z","updated":"2000-03-01T15:12:11.064Z","comments":true,"path":"2018/02/一场突如其来的感慨.html","link":"","permalink":"https://www.berwyn.cn/2018/02/一场突如其来的感慨.html","excerpt":"北京的生活，是一段在我人生中不可或缺的回忆，那里遇见了很多、接触了很多，也收获了很多。 如果没有在北京的那段经历，现在的我会是什么样子？实在不敢想像。 本以为在学校能流传故事已是奇迹，又听说离开两年后，前公司现在还有人知道我，故此来小小的感慨下。","text":"北京的生活，是一段在我人生中不可或缺的回忆，那里遇见了很多、接触了很多，也收获了很多。 如果没有在北京的那段经历，现在的我会是什么样子？实在不敢想像。 本以为在学校能流传故事已是奇迹，又听说离开两年后，前公司现在还有人知道我，故此来小小的感慨下。 一切的起由选择去北京读大学是一场没有经过深思熟虑的冒险。 在所填的意向院校里，只有一所湖南本地的，其余的不是西安就是北京这种文化古城。 也许是遵从隐藏在骨血深处的冒险与叛逆精神，所以才会选择去这么远的地方，去做一匹脱缰的野马。 盲目奔跑至脱力而亡，或者驰骋在无疆的草原上。 我的大学高中颓废了许久的自己终于准备洗心革面、重新做人，于是像很久很久很久以前一样，树立自己好学生的形象。 由于爱好众多、涉猎广泛，所以就不时有被刮目相看的时候，成功混入听话学生队伍，少了不少麻烦。 当时比较喜欢玩贴吧，偶然间加入了百度贴吧校园大使团队，由于我们的奖励机制是物资申请额度和奖金，于是团队派发的任务勾起了隐藏的奸商本性： 1.利用吧盟无法兼顾所有贴吧、大部分院校没有官方物资的需求，成立了高校互助团队，申请物资赞助了山东和湖南的几所院校活动。他们拿到了比较重视的官方物资，我则收获了业绩和奖金，有舍才有得，古人诚不欺我。不过后来被别的团队人举报了，不知道有什么好举报的，双方你情我愿的事儿，而且又对我造不成坏影响哈哈哈。 2.申请了本校贴吧吧主，因为最好的阵地永远是自己所熟悉的地方。而且经此发生了一系列的事情，所以一直以来对百度的感情真的是难以言说。 由于百度的资源加贴吧的权限，突然很多事情都变得大有可为起来。 在成功运维了一次迎新活动后，刚入学时萌生的创办社团的想法就蠢蠢欲动了，于是提交了创立社团的申请。 这期间……简直是折磨。 先是不懂规矩被社联部在会议室不开灯约谈，个别社长开手机真·校园恐怖片。 之前拒绝了某个社团以副社长职位换贴吧并入的要求，她的好友团就比较咄咄逼人。 期间实在要感谢老社长和TW学长帮我说了话，不然拍桌子走人，以后就很尴尬了。 最后甩了句“不创办社团就百度牵头申请工委会”结束了话题，不过真以为百度会签这个头吗？Naive。 好不容易过了社联部这一关，主管社团的老师又给卡着了，找了几次感觉都碰了一鼻子灰，后面不做指望的时候又突然被通知参加社团大会，跌宕起伏。 现在想想以前真的是不会做人，太狂太莽撞。天运垂怜，才没有将这根引火索浇灭在点燃的初刻。后面跟老社长他们吃了一顿饭，也听了他们的意见，变得克制了一点儿。 创建社团之后就一路顺风顺水了，占着贴吧这个大入口（新生都通过百度学校资料进入贴吧，而且招生期间对应院校贴吧会被百度优先置顶），顺势建立了微信公众号、微博，从此把持着院校的网络发声的渠道，如果不是有官网的话，估计网站也会被包干了。 社联部的问题也解决了，因为新任部长是女朋友的好朋友，所以好像也没什么问题了。 女朋友把持着线下发声渠道——广播站，我把持着网络发声渠道——自媒体，然后俩社团和负责人紧密地联系在一起了…… 一个优秀社团、一个优秀社长，又是一对情侣加各种故事，当然足够有噱头了。 17年的小迷弟也许听传说久了被洗脑了，还在微信公众号来了一场专访。 此处不甩链接结束话题。 我的工作实习时做了半年的酒店前台，实习结束后利用百度的实习证明进了家互联网公司做产品运营，后面又干过仨月的贵金属（良心过不去，没成交一单哈哈哈），在北京的最后一份工作就是CG了。 创业公司确实比较磨练人，这里的“磨练”是“折磨”和“锻炼”的意思 :) 在睡着以外都是感觉自己的肉体和灵魂剥离了 :( 然后第二天还得坚持坐很久的地铁去上班 庆幸当时主管专业而且带人比较尽心尽责，产品和运营相关的工具和思维都比较系统化，基础打得比较牢靠，这或许也是坚持下去的原因，学不完才会有动力。 然而，不到三个月就搬了两次办公地址，然后就倒闭了。不说承诺的福利，也不说自负餐饮交通费，老板还没发过一分钱…… 凭借着校园的实习经历和创业公司的项目经验，进入了让我吐槽到不愿承认爱过的——CG。 入职时P出差没在，第一次面试时就是被他女朋友刷掉了（我面运营，不知道市场指手画脚干嘛），如果第二次遇到还记得的话，鬼知道会怎么样哈哈哈。 可能在他回公司后的第一次考核通过了，又可能平常的工作沟通展示了亮点，又又可能比较了解他想要什么可以准确快速的给出解决方案，所以他才会在离职后还经常提起我吧。 今天突然听说P很喜欢我们（没错，我和女朋友在一家公司），顿时感觉有些唏嘘，突然间变老一场回忆杀…… 记得每次接到P的任务时会多想几步，尽量全面且细节化，所以基本邮件沟通两道就可以执行了（有些同事说一点才做一点，我若是上司早就要骂人了）。 现在还留着以前的来往邮件，跟他这种逻辑强的人沟通只要达到他的预期或者想得比他还全面，基本一切就很顺利了，还舍得放权。 有段时间公司突然推行内部分享会，运营部第一次会让我当众说《卖什么都是卖体验》观后感。 天啊！限定题材是因为当时是用户体验组长吗？当时想如果让讲《社会工程学攻防战》，说不定可以让所有听的人都有基本的隐私防护意识，这个主题的话，估计就是睡觉的催眠药了。 嗯……在分享前买了这本书、看了几遍、找出了重点、做了炫酷的PPT，不出意料的讲得一塌糊涂，然后P找个时间亲自指导我该怎么做，指定时间继续下一次的分享。 Orz P，我辜负了你的期望，幸亏第二次分享时你不在场，不然可能会有后面的三四五六七场的，直到你让自由选择题材或者你自己绝望为止…… 其实当初只感觉跟P相处起来比较契合，隐约觉得可能比较看重在培养自己，一直没觉得可以达到“喜欢”这个词，早知道这样我就不离职了啊！ 开玩笑的。编辑组的漩涡太深了，一堆女性可惹不起，不仅惹不起还躲不起。 我就一直想不通，刚入职时为什么因为有个女编辑想捧一个男运营就得来踩我，如果不是项目经理和运营经理双重保障，再加上生性冷淡不入圈子，估计早就GG了。 因为某个重要原因和无端的办公室争斗，再加上创业公司补发了一笔当时堪称“巨款”的欠薪，于是就辞职返湘，当时拿了几个Offer都没有留在北京的心思了。 今天听CG的人说起这些事，也会想一想如果还待在CG的话，总公司或分公司的管理层名单估计也有我吧。 哈哈哈，也想过当时留在创业公司，再坚持留到那个全程参与运维的项目获得千万融资时，可能半个人生赢家了吧。 没营养没意义的想法，不如歇着歇着歇着。 我的哔哔叨一直觉得内心老了的人，才会有这些感慨，后面一想，又像是一场对内心遗憾的追忆。 追根究底，可能不过是我喜欢北京，喜欢那里的天气、人文、建筑、氛围、遇到的人事物，以及几年来留存在那儿的记忆。 还有个内心深藏很久没实现的想法啊，等再去到北京的时候，肯定要在朋友圈发上一条： 我，胡汉三，又回来了！！！","categories":[{"name":"杂谈扯淡","slug":"杂谈扯淡","permalink":"https://www.berwyn.cn/categories/杂谈扯淡/"}],"tags":[{"name":"北京","slug":"北京","permalink":"https://www.berwyn.cn/tags/北京/"},{"name":"橙光游戏","slug":"橙光游戏","permalink":"https://www.berwyn.cn/tags/橙光游戏/"}]},{"title":"单个GitHub帐号下添加多个Pages","slug":"单个GitHub帐号下添加多个Pages","date":"2018-01-15T16:54:51.000Z","updated":"2018-03-04T14:15:47.842Z","comments":true,"path":"2018/01/单个GitHub帐号下添加多个Pages.html","link":"","permalink":"https://www.berwyn.cn/2018/01/单个GitHub帐号下添加多个Pages.html","excerpt":"记得某篇讲 Hexo 的文章里提到每个 GitHub 只能拥有一个 GitHub Pages 页面，所以后来一直不敢在自己的帐号底下添加除 Blog 外的其他 GitHub Pages 项目。 直到今天仔细研究了下GitHub的规则，才发现上面那句话有很大的问题。 这篇文章主要是讲 Github 下多个 GitHub Pages 项目相关以及自定义域名访问的问题.","text":"记得某篇讲 Hexo 的文章里提到每个 GitHub 只能拥有一个 GitHub Pages 页面，所以后来一直不敢在自己的帐号底下添加除 Blog 外的其他 GitHub Pages 项目。 直到今天仔细研究了下GitHub的规则，才发现上面那句话有很大的问题。 这篇文章主要是讲 Github 下多个 GitHub Pages 项目相关以及自定义域名访问的问题. 没太多技术上的东西。基本上都是属于 GitHub 的文档意译和解释，英语好的可以直接看这官网这两篇FAQ： About custom domains for GitHub Pages sites User, Organization, and Project Pages 注：虽然全文基本上都在讲 GitHub Pages ，但我个人亲测这些规则也都适用于 GitCafe Pages ，两者没有本质区别。所以像我一样双线部署 Blog 的可以安心地把 GitHub 的东西搬到 GitCafe 来。 不过为了行文方便，下文不再特意强调 GitCafe Page ，均以 GitHub Pages 代指。(“ Coding “的是否也如此并不清楚，有心人可以自测) 场景以我个人为例，我在GitHub上已经有了一个和用户名同名的 GitHub Pages 项目当作个人主页( example.github.io )，但是我现在又有了几个想法： 再在 GitHub 上弄一个 GitHub Pages 项目当作我的 Demo 页面展示，而不是在原先的 Blog 项目下加子目录。(一来访问 url 不好看，二来很多主题会强制对所有项目内的文件添加样式，影响展示效果) 同时 Demo 页面的访问链接是我自定义的一个域名(如：是 demo.example.com 或者 demo.example.github.io 而不是 example.github.io/demo ) 那么上面两个要求，GitHub 能否都满足呢？卖个关子先，结论放在下文。 GitHub Pages 的分类及区别根据官方文档，GitHub Pages 分为两类：个人/组织主页以及项目主页。 两者基本上没啥区别，但是有以下几点不同：(该文场景下个人和组织帐号没什么区别，所以下文为了行文方便将统一用个人主页代指) 个人主页必须要和用户的 GitHub 帐号同名，所以每个用户有且只能有一个 Repo 作为个人主页，且必须是 &lt;username&gt;/&lt;username&gt;.github.io 的形式；而项目主页的命名则没有这种限制，且数量有任意多个。 不考虑绑定的自定义域名的前提下，个人主页的 GitHub 二级域名为 &lt;username&gt;.github.io ，项目主页的 GitHub 二级域名为 &lt;username&gt;.github.io/&lt;projectname&gt; ，没有 &lt;projectname&gt;.&lt;username&gt;.github.io 这种方式。 个人主页的展示内容以 master 分支里的文件为准，而项目主页的展示内容以 gh-pages 分支内的文件为准。 从上面的分析可以发现两个问题已经解决掉一个半了，那么剩下来的问题就是如何配置一个项目主页并绑定自定义域名了。 项目主页的建立和自定义域名配置 注：配置过程和个人主页一模一样，如果之前配置过个人主页的，可以跳过这部分内容了 建立项目主页 新建一个 repo ，名字随意。 点进repo主页然后点击右面的 Settings ，页面往下拉到 GitHub Pages 部分，选择 Launch automatic page generator &gt; Continue to layouts&gt;Publish page 即可。(由于大部分情况下并不用默认的页面和样式，所以这里不需要太纠结于内容编辑) 这样一个项目主页就建立完成了，此时可以用 &lt;username&gt;.github.io/&lt;projectname&gt; 访问到了。 绑定自定义域名 在项目的 repo 里新建一个 CNAME 文件，并将不带协议名的裸域名写进去。( demo.example.com 而不是 http://demo.example.com/ ) 这一步可以参考 官方文档 。 到你域名的 DNS 服务商里给对应的二级域名添加 CNAME 解析到 &lt;username&gt;.github.io 。(和个人主页的配置相同) 等待DNS生效，具体时间和服务商有关。(十几分钟到几小时都有可能) 如果不确定自己的解析是否生效了，可以在 Linux 系统下用 Dig 命令来检测，参考官方文档。 GitHub 和 GitCafe 双线部署的小 Tips上面的配置对于单线部署的来说已经完成了，不过对于双线部署的用户而言，有几个小问题需要注意下 DNS 服务商里要按照来源对对应的二级域名做分流配置。 如果想要所有用户都可以用 example.com/project 的方式访问到 repo ，GitHub 和 GitCafe 的 repo 名字必须相同，否则会导致有一边跳 404 。可以参考我这里的例子： GitHub 上的项目主页名字为 demo ，GitCafe 上的项目主页名字为 demos ，则不翻墙的情况下国内用户访问 example.com/demo 会跳 404 ，而用 demo.example.com 则正常。 (另外同个链接在翻墙和不翻墙的情况下看到的页面不同，也是分线部署的功劳) 总结聊胜于无的总结。对于上面提到的几个问题，也有了答案： 每个 GitHub 帐号下只能有 1 个个人主页 repo ，但是可以有不限数量的项目主页 repo 。 没有自定义域名的情况下，项目主页的访问链接只能是 &lt;username&gt;.github.io/&lt;projectname&gt; 而不是 &lt;projectname&gt;.&lt;username&gt;.github.io 。 原文链接：https://segmentfault.com/a/1190000003946969","categories":[{"name":"分享教程","slug":"分享教程","permalink":"https://www.berwyn.cn/categories/分享教程/"}],"tags":[{"name":"Github","slug":"Github","permalink":"https://www.berwyn.cn/tags/Github/"}]},{"title":"这两年免费薅过的一些数字货币的羊毛","slug":"这两年免费薅过的一些虚拟货币的羊毛","date":"2018-01-14T06:04:24.000Z","updated":"2018-01-15T06:48:08.854Z","comments":true,"path":"2018/01/这两年免费薅过的一些虚拟货币的羊毛.html","link":"","permalink":"https://www.berwyn.cn/2018/01/这两年免费薅过的一些虚拟货币的羊毛.html","excerpt":"年前比特币一波大涨，又把视线重新拉回来了，然而上车已经晚了。 随后看到 2013 年 Github 送的 2020 枚 Ripple 币，竟然也值 17K ，感叹当时怎么没也去领一些。 不过，就算当时真拿了 BTC 或 XRP ，估计也拿不住吧，除非给忘了。","text":"年前比特币一波大涨，又把视线重新拉回来了，然而上车已经晚了。 随后看到 2013 年 Github 送的 2020 枚 Ripple 币，竟然也值 17K ，感叹当时怎么没也去领一些。 不过，就算当时真拿了 BTC 或 XRP ，估计也拿不住吧，除非给忘了。 观察了一段时间后，在 Blockchain 注册了个钱包，开始了薅免费羊毛之旅，毕竟市场价格起伏太大，利益与风险并存。 BTC —— FreeBitco.in这个是个坑，每天理论上可以领取 20-2000000 Satoshis ，但是会随着时间延长而减少，领了那么久最多给了 200 Satoshis 。 而且到了一定时期，人机验证会从一个变成两个，大大增加困难程度，为了20 Satoshis 真不值得。 加上 0.0003 BTC 才能提现的限额，所以之前领的准备哪天去玩博大小游戏了。 XMR —— CoinHive.com大概是一波 Monero 的挖矿病毒肆虐，看到了它的前景，所以就入坑啦。 刚开始是使用的 PPOI 的服务，因为抽成只有 10% ，不过待支付余额会随着挖矿难度减少，真是奇葩的设定。 已经都到挖回家的门罗币，你竟然还会自动减少，是在逗我吗？果断弃坑！ 那么重新回到 CoinHive 的怀抱，虽然需要抽成 30% ，但是不会自动缩水呀，而且还可以自由设置占用，不至于一运行就 100% 狂转。 其实很想放在网站上偷偷运行的，但是后面试了下效果，没必要为了这点钱影响用户体验，还不如 Google Adsense 赚钱呢，所以就自己电脑挂着玩玩了。 收益什么的，这个就当长期免费投资吧，说不定挖个一两年就暴涨了呢？ XIN —— Mixin.one这个就没什么好说的，填个手机号就会送 15 个 Mixin ，大约 20 RMB ，无聊拿着玩吧。 https://mixin.one/enroll/856913 ，注册就送 15 Mixin 。 MDS —— MediShares.org这个是跟保险行业挂钩的虚拟货币，未来前景也许很好，反正免费拿着不亏。 MDS 社区发新年糖果，注册参与测试领 MDS，最高 300MDS，赶紧看看。 邀请链接：http://candy.medishares.org/user/register/?ref=CH1513825195 ZEN —— ZenCash这个就是个意外了，原以为都这么高的价格了，没想到竟然还会有免费送币的。 这个由于每日限额就不详细说了，一天随便弄弄大概可以薅 0.005 个币，以后能不能财务自由就靠你了 总结由于现在各种虚拟货币参差不齐，所以投入资金需要谨慎。 偶尔去领些免费糖果，说不定到了最后，也可以赚点零花钱。 毕竟连 狗币 和 MLGB 这种恶搞币都可以涨成那样，以后的事谁说的定呢？ 至于财富自由……多靠自己的脑子，并且不断努力吧！","categories":[{"name":"区块链","slug":"区块链","permalink":"https://www.berwyn.cn/categories/区块链/"}],"tags":[{"name":"数字货币","slug":"数字货币","permalink":"https://www.berwyn.cn/tags/数字货币/"}]},{"title":"愿有生之年，我能有一款游戏走向世界","slug":"愿有生之年，我能有一款游戏走向世界","date":"2017-09-21T08:17:45.000Z","updated":"2018-01-14T07:51:47.032Z","comments":true,"path":"2017/09/愿有生之年，我能有一款游戏走向世界.html","link":"","permalink":"https://www.berwyn.cn/2017/09/愿有生之年，我能有一款游戏走向世界.html","excerpt":"上个月，因为一款文字游戏，结识了紫烟君，紫烟君又名“恬不知耻的紫烟”。 那会儿他说手上还有一款新游戏，但已然没心思，也没有灵感继续开发下去了，打算半卖半送脱手。","text":"上个月，因为一款文字游戏，结识了紫烟君，紫烟君又名“恬不知耻的紫烟”。 那会儿他说手上还有一款新游戏，但已然没心思，也没有灵感继续开发下去了，打算半卖半送脱手。 上个月，因为一款文字游戏，结识了紫烟君，紫烟君又名“恬不知耻的紫烟”，那会儿他说手上还有一款新游戏，但已然没心思，也没有灵感继续开发下去了，打算半卖半送脱手。 前几天，他突然来找我，说是游戏太水，不好意思卖，让我试玩他的新游戏，“丑儿子也是自己一点点生出来的，自己做的辣鸡游戏，跪着也要玩高分。”果然，在新游戏《太空甩枪舰》里，他“无耻”地用多个ID在排行榜上占领多个“山头”。 这是他第一次做游戏，用紫烟君自己的话说，他只是一只菜鸟，混迹在游戏行业，但无缘游戏开发，《六芒花：隐秘潜入》着实让自己过了一把瘾，更不用说这个“丑儿子”已被TapTap收录到“精品独立游戏”专题。对这段“特殊”的经历，紫烟君作了一个简单的分享。 菜鸟的自学手册：即兴发挥，善于借鉴其实制作《六芒花：隐秘潜入》与《太空甩枪舰》都是偶然，是我脑子一热就把学习作业给发布出来了。 我从小喜欢游戏，本身也从事游戏行业（虽然和游戏开发不沾边），但我做梦都想自己做游戏，撰写游戏剧情……可惜没有代码基础，平时又忙，于是只能着眼于最简单的文字游戏，《六芒花：隐秘潜入》一开始就是为了学习测试蝶梦文字游戏编辑器而随手起的头，通过主站的教程大概学了五分钟就会用了。由于对潜入类游戏的喜爱，所以在掌握编辑器后一发不可收拾的把它写完了，基本是边写边构思，即兴发挥，一个礼拜收工。 《太空甩枪舰》…咳咳，它属于一个比《六芒花：隐秘潜入》更学习性质的小作品，这次是学习全新的图形游戏引擎——gamemei游戏魅可视化引擎，相比于文字游戏编辑器，这款引擎上限要高很多，所以一切从头开始，花了三天上手，边学边做。由于找不到太多免费素材，于是用手头现有的素材结合最简单的玩法设计出来，学起来真的很累，不过因为是可视化不需要学太多代码。但构思大概只花了几分钟，其实是很厚颜无耻地把飞行射击和《是男人撑20秒》两种游戏机制结合了一下。 ##《六芒花：隐秘潜入》VS生命线：文字游戏该如何讲故事 1、节奏控制《六芒花：隐秘潜入》是一款文字游戏，游戏背景建立于一个架空世界，在一个叫“六芒花”的神秘组织里，两人一组，负责后台指挥的叫先知，负责深入虎穴的叫猎手，而在游戏中玩家扮演的就是先知，负责帮助猎手出谋划策，完成一个调查药物公司的任务。 创造灵感来源于《杀手47》、《孤岛危机》、《看门狗》，但很多玩家认为，它与《生命线》更为相像，它有着非常类似于《生命线》的纯文字选项类玩法，玩家控制的先知给出的建议会决定猎手的路线，控制着剧情的走向，也将决定猎手的生死安危~ 《生命线》在文字游戏界的地位不言而喻，当我第一次接触到编辑器，我第一反应也是《生命线》，我觉得《六芒花：隐秘潜入》相比于它，最大的区别就是——《六芒花：隐秘潜入》比它短，没它那么好玩…… 好吧，自嘲一下，短和可玩性不足都是事实，但实际上和《生命线》最大的区别在于，我很刻意的摒弃了《生命线》中广为诟病的超长等待时间，其实《六芒花：隐秘潜入》全本字数也有18000字多，但玩起来非常快，原因就是我没有设置任何超过五秒以上的等待，将游戏的节奏尽可能加快，虽然玩通只要几分钟，但只求玩家姥爷通的过程是爽快的，而不是磨耐心。 2、扬长避短，另辟蹊径相较于视频游戏，文字游戏在表现力上有着天然的弱势，我曾经是全职的网络小说写手，所以我能够有自信奉献给玩家的，大部分还是剧情和设定，希望能够在玩的过程中得到一种阅读式的惯性和沉浸感。 作为玩家和作者，我更希望文案作者能够切身代入到角色中去设计对话和分支选项，故事可以天马行空，但人设千万不能崩坏，不要想当然的用“我觉得”去定义一个角色，角色都是活的，要让自己去跟着角色思考，让角色自己说话。 （这里就不点名批评某负面例子，某知名文字游戏的二代，就有些想当然地去给女主角加戏删戏，各种强行打断玩家的反馈，体验至少让我非常不舒适……） 在《六芒花》的最初设定当中，其实盖恩和先知都是很模糊的形象，唯一确定的，是为了符合“猎手”只擅长行动的设定，盖恩要表现的相对不那么聪明，于是从这个“不聪明”这点上，延伸出了许多的性格特征，比如盖恩的判断力差，自恋，好脾气…而为了对应这些特征产生对白和剧情上的冲突点，先知（玩家）的性格设定就会偏向相反的方向——果断，毒舌，爱挖苦。 游戏中有许多选项其实是不会影响剧情走向的，这些选项存在的意义其实就是让玩家更好的代入进角色的性格，用对话来加强刻画盖恩的性格特点，想来这对于一款简陋到没有立绘的文字游戏而言还是很重要的…… 若要抛开“字”能解决的问题，就只能在美术，音乐，玩法上下功夫了。 美术和音乐已经见多不怪了，如何利用美术设计或音乐特效与文字游戏结合，使之更加分一些，这其中有很多门道，我玩《生命线》的时候就非常喜欢它对讲机式的界面设计。 《生命线》对讲机图 《六芒花：隐秘潜入》对讲机图 而玩法上，文字游戏不一定局限于“选项”这个互动点，我在《六芒花：隐秘潜入》中就尝试着加入了图形智力题以及一个考验发散思维的迷宫，这一点上我觉得我玩过做得最棒的，无疑是《Replica》。 3、善于设“局”上面说到迷宫的设置，这里就来详细地说一说。撇开我不要脸的参（chao）考（xi）门萨智力测试的那些题，《六芒花：隐秘潜入》中的蜂巢迷宫是完全我自己琢磨出来的玩法。 最初的时候其实我是准备画一个蜂巢状的迷宫，设置一条正确路线和几条错误路线，然后将它完全转换为文字形式，这种玩法的效果十分类似于《最强大脑》中的蜂巢迷宫，考验的主要是立体思维和记忆力……然而后来放弃了，原因是这样的难度玩起来太难了，考虑到游戏整体的快节奏，我不希望出现在迷宫卡关卡一天的情况。 《最强大脑》蜂巢迷宫图 于是我换了个简单的思路，只要根据某个提示去理解，就可以畅通无阻的解开迷宫。在游戏中所给的提示是一串煞有其事的二进制代码，由1和0组成，其实对应的规律连小学知识都可以解开，1代表左，0代表右。随手写下一串1和0组成的提示后，我将正确的路线以一条顺序的逻辑线写了出来，但是由于编辑器不能设置同内容的选项，于是不能重复使用[左]和[右]作为选项文本，我就顺手在制作过程中将正确的路线每个选项搭配一个编号，依次为13579…至19，也就是所有单数按顺序代表了正确路线，反之的那条路用2-20标注，都是错误的路线。在错误的路线中，我将跳转打乱，但不设置跳转到最后一步的情况，于是只要走错到了错误的循环里，就会出现一种鬼打墙的错觉。 后来测试的时候发觉，原本1-20的标注太明显了，比那个1和0的提示还要简单，所以为了混淆视听，把1-20交错打乱对应字母表的A-T，然后用字母来编号标注选项，一方面解决了选项文本重名的问题，另一方面也算扰乱了玩家的判断吧…… 《六芒花：隐秘潜入》迷宫最终设计图 对‘辣鸡游戏’也会抱有三分理解敬畏和宽容游戏之于我，往小了说是消遣和用爱发电，往大了说是一种积累和感恩。 但是游戏开发并不是一件简单的事，尤其是对于零基础的新手而言，下定决心做这么一件事确实需要更多的勇气和努力。《六芒花：隐秘潜入》的开发过程倒算是一帆风顺，然而在《太空甩枪舰》的开发中，开始用真正的图形游戏引擎就会发觉自己欠缺的实在太多了。最基础的代码思维就需要很长时间去培养，有时候写个简单的逻辑会脑子卡壳想不出相应的触发规则头痛不已。再者缺乏经验导致很难直观的感受到1px大概是移动多远距离，2000ms大概是过了多久会触发，于是我在手感的优化上非常吃力…… 《太空甩枪舰》游戏截图 因为某些原因我平时接触过不少开发者，大到隐于市的大厂员工，小到刚出道的独立开发人，国内开发者不少是半路出家，没有专业的系统化的教学，更多是靠天分和热情去做游戏，这样弯路更多，做游戏的周期也就长了，更累，甚至很容易中途放弃热情。 通过亲身实践，我深知开发游戏的艰辛，此后我再玩到所谓的“辣鸡游戏”，也会抱有三分理解敬畏和宽容了。 最后 苹果申请开发者太麻烦，所以《六芒花：隐秘潜入》暂无开发iOS版本的计划，有兴趣的同学可以到这里体验试玩： http://www.iwzyx.com/games/180 对于市场，我不抱有任何期待，因为我目前真的不打算（没自信）做商业游戏，本就是学习作品就不大言不惭的谈市场了吧…… 注：这篇文章是上网时无意间看到的，该作者是站上的一个作者，所以全文转载过来。来源：http://www.gameres.com/747850.html","categories":[{"name":"杂谈扯淡","slug":"杂谈扯淡","permalink":"https://www.berwyn.cn/categories/杂谈扯淡/"}],"tags":[{"name":"互动小说","slug":"互动小说","permalink":"https://www.berwyn.cn/tags/互动小说/"}]},{"title":"坑比的人性，操蛋的王者荣耀","slug":"坑比的人性和操蛋的王者荣耀","date":"2017-06-15T16:28:33.000Z","updated":"2018-01-14T07:09:51.626Z","comments":true,"path":"2017/06/坑比的人性和操蛋的王者荣耀.html","link":"","permalink":"https://www.berwyn.cn/2017/06/坑比的人性和操蛋的王者荣耀.html","excerpt":"已经很久不玩游戏，但还是在半个多月前喝了王者农药，目测还有逐渐上瘾的趋势。 不得不说，排名是最让人有玩下去欲望的手段，尤其是自己朋友圈子里的。 果然，最会做游戏的也最会洞察人性。","text":"已经很久不玩游戏，但还是在半个多月前喝了王者农药，目测还有逐渐上瘾的趋势。 不得不说，排名是最让人有玩下去欲望的手段，尤其是自己朋友圈子里的。 果然，最会做游戏的也最会洞察人性。 起先玩的是全民超神，不过当时瘾不是很大，卸载游戏就给戒掉了。 不记得什么原因入的农药坑，一路爬到尊贵铂金Ⅰ，最高差一局就到钻石了。 不过今天不知道什么原因，连跪了九把，到了后面真的没一点脾气，骂人都骂不出了。 以前输了还会随手举报，自从发现举报别人一个都不过，别人举报自己直接扣分的傻缺设定后，还是省了那点力气吧。 果断卸载，再玩就活该被玩，谁也救不了。 一、游戏的思考王者荣耀作为如此火爆的游戏，自然可以吸取几个优点： 1 基于朋友社交的排行榜 我是使用微信登陆的，微信作为亲密朋友的通讯工具，都是一些平常联系比较强或关系比较深的人。 如果能够占据他们的排行榜前五，每天都被看到是一种可以长脸的事情，平常打死不联系的人都会发送游戏邀请。 而对于某些吸引关注的人来说，更加具有吸引力。 2 完善的成就系统 当辅以称号等虚荣物品时，游戏里的成就系统是促进玩家完成任务的最强手段。 王者荣耀里的成就包涵了引导、对战、商城消费、社交等，像是一张紧密的大网，牢牢地将人锁在里面，还让外面的人被陷在里面的人给引入坑。 3 众多女性用户 曾几何时，女生是最讨厌男生玩英雄联盟的人，如今她们却也已陷入农药无可自拔，顺带着拉上自己的男朋友和备胎。 游戏中的充满CP属性的角色以及各种华丽的角色皮肤，无不一一吸引着女性用户，为虚拟道具不停砸钱或让人帮着砸钱。 多么让人羡慕的优势，毕竟女性玩家可以吸引到一半以上的男性玩家。 二、人性的思考本身对于游戏是没有什么瘾的，这次主要是朋友圈排行可以装逼才入的坑。 对于平生无所成就的人来说，游戏是快速实现人生价值的另一途捷径。 而且对战与赌博都有不可预知性，谁也不知道自己是不是最后的赢家，所以入局的都会有种赌徒心理： 赢了这局也许下一局接着会赢，输了这局也许下一局会翻盘赢了。 假如说是今天这样连着跪了9局怎么办？ ——跪了这么久，总要赢了吧。 所以说，入坑容易脱坑难啊！ 三、如何抵制？先做到果断删除游戏，虽然再次下载也就几分钟的事情，但有了这一步才会有下面的几步。 然后就是冷静下来，想一想自己所要的人生究竟是什么样的，能在游戏里实现财务自由、房车任买、女神入怀吗？ 最后就是真切的后怕，以及对此避之不及的恐惧了，毕竟二十多岁的最好年华竟然被一款游戏给毁了。 最后：不过说真的，不连跪到自己怀疑人生，也许你还会觉得自己下一局会赢。 :)","categories":[{"name":"杂谈扯淡","slug":"杂谈扯淡","permalink":"https://www.berwyn.cn/categories/杂谈扯淡/"}],"tags":[{"name":"王者荣耀","slug":"王者荣耀","permalink":"https://www.berwyn.cn/tags/王者荣耀/"}]},{"title":"从设计到上线，如何运维一个新的网站","slug":"如何从零开始运维一个新的网站","date":"2017-06-15T11:01:38.000Z","updated":"2017-06-21T08:53:58.302Z","comments":true,"path":"2017/06/如何从零开始运维一个新的网站.html","link":"","permalink":"https://www.berwyn.cn/2017/06/如何从零开始运维一个新的网站.html","excerpt":"从大学至今陆续做了几个站，Wordpress、Discuz、PHPwind以及其他都有尝试过，总的来说还是够用的。 可惜的是，都没有坚持下来，主要是因为没有特色，难以存活。 不过现在讲的不是这些失败品，而是如何设计一个产品，进行推广与后续运维。","text":"从大学至今陆续做了几个站，Wordpress、Discuz、PHPwind以及其他都有尝试过，总的来说还是够用的。 可惜的是，都没有坚持下来，主要是因为没有特色，难以存活。 不过现在讲的不是这些失败品，而是如何设计一个产品，进行推广与后续运维。 一、设计与实现阶段1 先确定自身产品的定位，可以使用 Mindmanager 整理好思维导图，这样做产品原型时会事半功倍。 2 大概知道会做成什么样后，可以使用 Axure 设计产品原型，只需要个大概的 Demo ，方便交给技术人员做出来。如果精益求精做出互动效果来，那是更好的了。 3 做好原型后，非技术人员可以联系外包了。我是在 V2EX 发布了外包需求，简单沟通对比了一下就确定了开发人员。付款一般采取 3-4-3 ，这个阶段比较考验人心，能不能靠谱看运气。所以要有保障的话，可以去 Shixian.com 等三方交易平台，至于猪八戒那种已经知名的大平台，可能会聚集了一大批实习生工作的外包公司。 4 交付定金后，自己购买域名和服务器，技术就会开工了，这段时期经常联系沟通，确保是自己要的最终效果。 二、上线推广阶段在设计与实现产品或者更早前，应该就要知道自己的产品面对的是什么样的人群，这样才能有针对性的进行推广，避免时间与精力上的浪费。 上线推广可以分为两波： 1 主动推广：主动推广的意义在于，你在任何可以留信息的地方，发布产品上线信息，吸引关注。手段包括不仅限于：QQ群、邮件、论坛、百度百科、百度知道、知乎、微博等，尽量选取高权重的大平台，而且要在有针对性的版块区域。 2 被动推广: 这一块主要是网站自身基础，比如网站关键词、网站地图、站点内容等。有内容会吸引游戏驻留与注册，以及提升搜索引擎收录量。SEO则是精准获取用户，毕竟用户使用搜索引擎的时候，只能搜关键词。 三、日常运维当开始有用户后，可以在其中选取协管人员，解放自己的工作量，从而有时间去做更重要的事情。 暂时就这样吧，以后再填坑。","categories":[{"name":"产品运营","slug":"产品运营","permalink":"https://www.berwyn.cn/categories/产品运营/"}],"tags":[{"name":"产品设计","slug":"产品设计","permalink":"https://www.berwyn.cn/tags/产品设计/"},{"name":"网站运营","slug":"网站运营","permalink":"https://www.berwyn.cn/tags/网站运营/"}]},{"title":"快速使用Jekyll-now在Github搭建博客","slug":"快速使用Jekyll-now在Github搭建博客","date":"2017-06-13T02:17:29.000Z","updated":"2017-06-15T12:26:07.670Z","comments":true,"path":"2017/06/快速使用Jekyll-now在Github搭建博客.html","link":"","permalink":"https://www.berwyn.cn/2017/06/快速使用Jekyll-now在Github搭建博客.html","excerpt":"本来想学会用Jekyll和Hexo在Github搭建博客的，然后不出意外的困在本地部署上了。 再然后瞎搜了搜，就发现了可以在线编辑的利器 —— Jekyll-now ! 不过…… 通过勤查苦试我还是学会了 Hexo ，所以分享下吧，也许有人需要呢。","text":"本来想学会用Jekyll和Hexo在Github搭建博客的，然后不出意外的困在本地部署上了。 再然后瞎搜了搜，就发现了可以在线编辑的利器 —— Jekyll-now ! 不过…… 通过勤查苦试我还是学会了 Hexo ，所以分享下吧，也许有人需要呢。 Jekyll-now主要功能： 响应式以及移动客户端优化的主题 Markdown 支持 语法高亮 集成 Disqus 评论 集成 Google Analytics 统计 底部提供 SVG 格式的社会化图标 极少的 http 请求 无需安装依赖 无需设置本地开发环境 无需配置插件 无需花费时间在主题上 Jekyll-now部署步骤： 前往 Jekyll-now Fork项目 ； 在设置里将项目名称改为 yourgithubusername.github.io ，如：berwyns.github.io ； 在 _config.yml 文件里修改博客名称、描述以及头像 ； 开始访问你的博客，yourgithubusername.github.io 。 为什么写这篇文章？因为网上教使用Jekyll-now搭建博客的中文教程屈指可数，这么好的引流材料为什么不用呢？ 突然感觉自己很机智，SEO意识666~~~","categories":[{"name":"分享教程","slug":"分享教程","permalink":"https://www.berwyn.cn/categories/分享教程/"}],"tags":[{"name":"Github","slug":"Github","permalink":"https://www.berwyn.cn/tags/Github/"},{"name":"Jekyll","slug":"Jekyll","permalink":"https://www.berwyn.cn/tags/Jekyll/"}]}]}