{"meta":{"title":"Berwyn's Blog","subtitle":"生而逐梦，不问归期。","description":null,"author":"Berwyn","url":"https://www.berwyn.cn"},"pages":[{"title":"404 Not Found：该页无法显示","date":"2018-03-04T14:15:12.908Z","updated":"2018-01-13T19:00:47.993Z","comments":false,"path":"/404.html","permalink":"https://www.berwyn.cn//404.html","excerpt":"","text":""},{"title":"关于","date":"2018-04-21T05:00:09.056Z","updated":"2018-04-21T05:00:09.056Z","comments":true,"path":"about/index.html","permalink":"https://www.berwyn.cn/about/index.html","excerpt":"","text":"本人兴趣广泛、爱好众多，然而都学而不精。 坚定贯彻落实“XXX从入门到放弃、XXX从卸载到跑路”思想，一百年不动摇。 这个博客是为了记录生活，锤炼文字能力，偶尔的奇思妙想和吐槽。 好吧好吧，可能大部分是喜欢吐槽。 如果你希望支持本站，留个言让我看见你吧~"},{"title":"书单","date":"2018-03-04T14:15:12.924Z","updated":"2018-01-13T16:45:56.737Z","comments":false,"path":"books/index.html","permalink":"https://www.berwyn.cn/books/index.html","excerpt":"","text":""},{"title":"分类","date":"2018-03-04T14:15:12.928Z","updated":"2018-01-13T16:45:56.738Z","comments":false,"path":"categories/index.html","permalink":"https://www.berwyn.cn/categories/index.html","excerpt":"","text":""},{"title":"友链","date":"2018-03-05T13:15:39.027Z","updated":"2018-03-05T13:15:39.027Z","comments":true,"path":"links/index.html","permalink":"https://www.berwyn.cn/links/index.html","excerpt":"","text":""},{"title":"项目","date":"2018-03-04T16:43:44.800Z","updated":"2018-03-04T16:43:44.800Z","comments":true,"path":"repository/index.html","permalink":"https://www.berwyn.cn/repository/index.html","excerpt":"","text":""},{"title":"标签","date":"2018-03-04T14:15:12.900Z","updated":"2018-01-13T16:45:56.832Z","comments":false,"path":"tags/index.html","permalink":"https://www.berwyn.cn/tags/index.html","excerpt":"","text":""}],"posts":[{"title":"对于当前工作与处境上的思考","slug":"对于当前工作与处境上的思考","date":"2018-05-09T16:04:52.000Z","updated":"2018-05-10T09:51:44.134Z","comments":true,"path":"2018/05/对于当前工作与处境上的思考.html","link":"","permalink":"https://www.berwyn.cn/2018/05/对于当前工作与处境上的思考.html","excerpt":"最近发生了一些事情，佛性已经被消磨得差不多了，故有此思考。 关于工作上的反思，以及未来人生的规划。","text":"最近发生了一些事情，佛性已经被消磨得差不多了，故有此思考。 关于工作上的反思，以及未来人生的规划。","categories":[{"name":"自言自语","slug":"自言自语","permalink":"https://www.berwyn.cn/categories/自言自语/"}],"tags":[{"name":"职场话题","slug":"职场话题","permalink":"https://www.berwyn.cn/tags/职场话题/"}]},{"title":"百度前端技术学院编码挑战","slug":"百度前端技术学院编码挑战","date":"2018-04-22T16:54:51.000Z","updated":"2018-05-10T09:55:24.341Z","comments":true,"path":"2018/04/百度前端技术学院编码挑战.html","link":"","permalink":"https://www.berwyn.cn/2018/04/百度前端技术学院编码挑战.html","excerpt":"百度Web前端技术学院（Baidu Institute of Front-End Technology 简称IFE）是一个由百度EFE团队、百度人力资源部校园招聘组联合出品的前端培训组织。 借助百度大量优秀的前端工程师以及丰富的前端知识积累，更加高效、系统地学习Web前端技术。","text":"百度Web前端技术学院（Baidu Institute of Front-End Technology 简称IFE）是一个由百度EFE团队、百度人力资源部校园招聘组联合出品的前端培训组织。 借助百度大量优秀的前端工程师以及丰富的前端知识积累，更加高效、系统地学习Web前端技术。","categories":[{"name":"前端技术","slug":"前端技术","permalink":"https://www.berwyn.cn/categories/前端技术/"}],"tags":[{"name":"百度","slug":"百度","permalink":"https://www.berwyn.cn/tags/百度/"}]},{"title":"一场突如其来的感慨","slug":"一场突如其来的感慨","date":"2018-02-26T11:47:30.000Z","updated":"2018-05-10T09:51:44.142Z","comments":true,"path":"2018/02/一场突如其来的感慨.html","link":"","permalink":"https://www.berwyn.cn/2018/02/一场突如其来的感慨.html","excerpt":"北京的生活，是一段在我人生中不可或缺的回忆，那里遇见了很多、接触了很多，也收获了很多。 如果没有在北京的那段经历，现在的我会是什么样子？实在不敢想像。 本以为在学校能流传故事已是奇迹，又听说离开两年后，前公司现在还有人知道我，故此来小小的感慨下。","text":"北京的生活，是一段在我人生中不可或缺的回忆，那里遇见了很多、接触了很多，也收获了很多。 如果没有在北京的那段经历，现在的我会是什么样子？实在不敢想像。 本以为在学校能流传故事已是奇迹，又听说离开两年后，前公司现在还有人知道我，故此来小小的感慨下。 一切的起由选择去北京读大学是一场没有经过深思熟虑的冒险。 在所填的意向院校里，只有一所湖南本地的，其余的不是西安就是北京这种文化古城。 也许是遵从隐藏在骨血深处的冒险与叛逆精神，所以才会选择去这么远的地方，去做一匹脱缰的野马。 盲目奔跑至脱力而亡，或者驰骋在无疆的草原上。 我的大学高中颓废了许久的自己终于准备洗心革面、重新做人，于是像很久很久很久以前一样，树立自己好学生的形象。 由于爱好众多、涉猎广泛，所以就不时有被刮目相看的时候，成功混入听话学生队伍，少了不少麻烦。 当时比较喜欢玩贴吧，偶然间加入了百度贴吧校园大使团队，由于我们的奖励机制是物资申请额度和奖金，于是团队派发的任务勾起了隐藏的奸商本性： 1.利用吧盟无法兼顾所有贴吧、大部分院校没有官方物资的需求，成立了高校互助团队，申请物资赞助了山东和湖南的几所院校活动。他们拿到了比较重视的官方物资，我则收获了业绩和奖金，有舍才有得，古人诚不欺我。不过后来被别的团队人举报了，不知道有什么好举报的，双方你情我愿的事儿，而且又对我造不成坏影响哈哈哈。 2.申请了本校贴吧吧主，因为最好的阵地永远是自己所熟悉的地方。而且经此发生了一系列的事情，所以一直以来对百度的感情真的是难以言说。 由于百度的资源加贴吧的权限，突然很多事情都变得大有可为起来。 在成功运维了一次迎新活动后，刚入学时萌生的创办社团的想法就蠢蠢欲动了，于是提交了创立社团的申请。 这期间……简直是折磨。 先是不懂规矩被社联部在会议室不开灯约谈，个别社长开手机真·校园恐怖片。 之前拒绝了某个社团以副社长职位换贴吧并入的要求，她的好友团就比较咄咄逼人。 期间实在要感谢老社长和TW学长帮我说了话，不然拍桌子走人，以后就很尴尬了。 最后甩了句“不创办社团就百度牵头申请工委会”结束了话题，不过真以为百度会签这个头吗？Naive。 好不容易过了社联部这一关，主管社团的老师又给卡着了，找了几次感觉都碰了一鼻子灰，后面不做指望的时候又突然被通知参加社团大会，跌宕起伏。 现在想想以前真的是不会做人，太狂太莽撞。天运垂怜，才没有将这根引火索浇灭在点燃的初刻。后面跟老社长他们吃了一顿饭，也听了他们的意见，变得克制了一点儿。 创建社团之后就一路顺风顺水了，占着贴吧这个大入口（新生都通过百度学校资料进入贴吧，而且招生期间对应院校贴吧会被百度优先置顶），顺势建立了微信公众号、微博，从此把持着院校的网络发声的渠道，如果不是有官网的话，估计网站也会被包干了。 社联部的问题也解决了，因为新任部长是女朋友的好朋友，所以好像也没什么问题了。 女朋友把持着线下发声渠道——广播站，我把持着网络发声渠道——自媒体，然后俩社团和负责人紧密地联系在一起了…… 一个优秀社团、一个优秀社长，又是一对情侣加各种故事，当然足够有噱头了。 17年的小迷弟也许听传说久了被洗脑了，还在微信公众号来了一场专访。 此处不甩链接结束话题。 我的工作实习时做了半年的酒店前台，实习结束后利用百度的实习证明进了家互联网公司做产品运营，后面又干过仨月的贵金属（良心过不去，没成交一单哈哈哈），在北京的最后一份工作就是CG了。 创业公司确实比较磨练人，这里的“磨练”是“折磨”和“锻炼”的意思 :) 在睡着以外都是感觉自己的肉体和灵魂剥离了 :( 然后第二天还得坚持坐很久的地铁去上班 庆幸当时主管专业而且带人比较尽心尽责，产品和运营相关的工具和思维都比较系统化，基础打得比较牢靠，这或许也是坚持下去的原因，学不完才会有动力。 然而，不到三个月就搬了两次办公地址，然后就倒闭了。不说承诺的福利，也不说自负餐饮交通费，老板还没发过一分钱…… 凭借着校园的实习经历和创业公司的项目经验，进入了让我吐槽到不愿承认爱过的——CG。 入职时P出差没在，第一次面试时就是被他女朋友刷掉了（我面运营，不知道市场指手画脚干嘛），如果第二次遇到还记得的话，鬼知道会怎么样哈哈哈。 可能在他回公司后的第一次考核通过了，又可能平常的工作沟通展示了亮点，又又可能比较了解他想要什么可以准确快速的给出解决方案，所以他才会在离职后还经常提起我吧。 今天突然听说P很喜欢我们（没错，我和女朋友在一家公司），顿时感觉有些唏嘘，突然间变老一场回忆杀…… 记得每次接到P的任务时会多想几步，尽量全面且细节化，所以基本邮件沟通两道就可以执行了（有些同事说一点才做一点，我若是上司早就要骂人了）。 现在还留着以前的来往邮件，跟他这种逻辑强的人沟通只要达到他的预期或者想得比他还全面，基本一切就很顺利了，还舍得放权。 有段时间公司突然推行内部分享会，运营部第一次会让我当众说《卖什么都是卖体验》观后感。 天啊！限定题材是因为当时是用户体验组长吗？当时想如果让讲《社会工程学攻防战》，说不定可以让所有听的人都有基本的隐私防护意识，这个主题的话，估计就是睡觉的催眠药了。 嗯……在分享前买了这本书、看了几遍、找出了重点、做了炫酷的PPT，不出意料的讲得一塌糊涂，然后P找个时间亲自指导我该怎么做，指定时间继续下一次的分享。 Orz P，我辜负了你的期望，幸亏第二次分享时你不在场，不然可能会有后面的三四五六七场的，直到你让自由选择题材或者你自己绝望为止…… 其实当初只感觉跟P相处起来比较契合，隐约觉得可能比较看重在培养自己，一直没觉得可以达到“喜欢”这个词，早知道这样我就不离职了啊！ 开玩笑的。编辑组的漩涡太深了，一堆女性可惹不起，不仅惹不起还躲不起。 我就一直想不通，刚入职时为什么因为有个女编辑想捧一个男运营就得来踩我，如果不是项目经理和运营经理双重保障，再加上生性冷淡不入圈子，估计早就GG了。 因为某个重要原因和无端的办公室争斗，再加上创业公司补发了一笔当时堪称“巨款”的欠薪，于是就辞职返湘，当时拿了几个Offer都没有留在北京的心思了。 今天听CG的人说起这些事，也会想一想如果还待在CG的话，总公司或分公司的管理层名单估计也有我吧。 哈哈哈，也想过当时留在创业公司，再坚持留到那个全程参与运维的项目获得千万融资时，可能半个人生赢家了吧。 没营养没意义的想法，不如歇着歇着歇着。 我的哔哔叨一直觉得内心老了的人，才会有这些感慨，后面一想，又像是一场对内心遗憾的追忆。 追根究底，可能不过是我喜欢北京，喜欢那里的天气、人文、建筑、氛围、遇到的人事物，以及几年来留存在那儿的记忆。 还有个内心深藏很久没实现的想法啊，等再去到北京的时候，肯定要在朋友圈发上一条： 我，胡汉三，又回来了！！！","categories":[{"name":"自言自语","slug":"自言自语","permalink":"https://www.berwyn.cn/categories/自言自语/"}],"tags":[{"name":"北京","slug":"北京","permalink":"https://www.berwyn.cn/tags/北京/"},{"name":"百度","slug":"百度","permalink":"https://www.berwyn.cn/tags/百度/"},{"name":"橙光游戏","slug":"橙光游戏","permalink":"https://www.berwyn.cn/tags/橙光游戏/"}]},{"title":"这两年免费薅过的一些数字货币的羊毛","slug":"这两年免费薅过的一些虚拟货币的羊毛","date":"2018-01-14T06:04:24.000Z","updated":"2018-05-09T16:06:36.021Z","comments":true,"path":"2018/01/这两年免费薅过的一些虚拟货币的羊毛.html","link":"","permalink":"https://www.berwyn.cn/2018/01/这两年免费薅过的一些虚拟货币的羊毛.html","excerpt":"年前比特币一波大涨，又把视线重新拉回来了，然而上车已经晚了。 随后看到 2013 年 Github 送的 2020 枚 Ripple 币，竟然也值 17K ，感叹当时怎么没也去领一些。 不过，就算当时真拿了 BTC 或 XRP ，估计也会拿不住吧，除非给忘了。","text":"年前比特币一波大涨，又把视线重新拉回来了，然而上车已经晚了。 随后看到 2013 年 Github 送的 2020 枚 Ripple 币，竟然也值 17K ，感叹当时怎么没也去领一些。 不过，就算当时真拿了 BTC 或 XRP ，估计也会拿不住吧，除非给忘了。 观察了一段时间后，在 Blockchain 注册了个钱包，开始了薅免费羊毛之旅，毕竟市场价格起伏太大，利益与风险并存。 BTC —— FreeBitco.in这个是个坑，每天理论上可以领取 20-2000000 Satoshis ，但是会随着时间延长而减少，领了那么久最多给了 200 Satoshis 。 而且到了一定时期，人机验证会从一个变成两个，大大增加困难程度，为了20 Satoshis 真不值得。 加上 0.0003 BTC 才能提现的限额，所以之前领的准备哪天去玩博大小游戏了。 XMR —— CoinHive.com大概是一波 Monero 的挖矿病毒肆虐，看到了它的前景，所以就入坑啦。 刚开始是使用的 PPOI 的服务，因为抽成只有 10% ，不过待支付余额会随着挖矿难度减少，真是奇葩的设定。 已经都到挖回家的门罗币，你竟然还会自动减少，是在逗我吗？果断弃坑！ 那么重新回到 CoinHive 的怀抱，虽然需要抽成 30% ，但是不会自动缩水呀，而且还可以自由设置占用，不至于一运行就 100% 狂转。 其实很想放在网站上偷偷运行的，但是后面试了下效果，没必要为了这点钱影响用户体验，还不如 Google Adsense 赚钱呢，所以就自己电脑挂着玩玩了。 收益什么的，这个就当长期免费投资吧，说不定挖个一两年就暴涨了呢？ XIN —— Mixin.one这个就没什么好说的，填个手机号就会送 15 个 Mixin ，大约 20 RMB ，无聊拿着玩吧。 https://mixin.one/enroll/856913 ，注册就送 15 Mixin 。 MDS —— MediShares.org这个是跟保险行业挂钩的虚拟货币，未来前景也许很好，反正免费拿着不亏。 MDS 社区发新年糖果，注册参与测试领 MDS，最高 300MDS，赶紧看看。 邀请链接：http://candy.medishares.org/user/register/?ref=CH1513825195 ZEN —— ZenCash这个就是个意外了，原以为都这么高的价格了，没想到竟然还会有免费送币的。 这个由于每日限额就不详细说了，一天随便弄弄大概可以薅 0.005 个币，以后能不能财务自由就靠你了 总结由于现在各种虚拟货币参差不齐，所以投入资金需要谨慎。 偶尔去领些免费糖果，说不定到了最后，也可以赚点零花钱。 毕竟连 狗币 和 MLGB 这种恶搞币都可以涨成那样，以后的事谁说的定呢？ 至于财富自由…… 多靠自己的脑子，并且不断努力吧！","categories":[{"name":"自言自语","slug":"自言自语","permalink":"https://www.berwyn.cn/categories/自言自语/"}],"tags":[{"name":"数字货币","slug":"数字货币","permalink":"https://www.berwyn.cn/tags/数字货币/"}]},{"title":"愿有生之年，我能有一款游戏走向世界","slug":"愿有生之年，我能有一款游戏走向世界","date":"2017-09-21T08:17:45.000Z","updated":"2018-04-21T04:42:05.832Z","comments":true,"path":"2017/09/愿有生之年，我能有一款游戏走向世界.html","link":"","permalink":"https://www.berwyn.cn/2017/09/愿有生之年，我能有一款游戏走向世界.html","excerpt":"上个月，因为一款文字游戏，结识了紫烟君，紫烟君又名“恬不知耻的紫烟”。 那会儿他说手上还有一款新游戏，但已然没心思，也没有灵感继续开发下去了，打算半卖半送脱手。","text":"上个月，因为一款文字游戏，结识了紫烟君，紫烟君又名“恬不知耻的紫烟”。 那会儿他说手上还有一款新游戏，但已然没心思，也没有灵感继续开发下去了，打算半卖半送脱手。 上个月，因为一款文字游戏，结识了紫烟君，紫烟君又名“恬不知耻的紫烟”，那会儿他说手上还有一款新游戏，但已然没心思，也没有灵感继续开发下去了，打算半卖半送脱手。 前几天，他突然来找我，说是游戏太水，不好意思卖，让我试玩他的新游戏，“丑儿子也是自己一点点生出来的，自己做的辣鸡游戏，跪着也要玩高分。”果然，在新游戏《太空甩枪舰》里，他“无耻”地用多个ID在排行榜上占领多个“山头”。 这是他第一次做游戏，用紫烟君自己的话说，他只是一只菜鸟，混迹在游戏行业，但无缘游戏开发，《六芒花：隐秘潜入》着实让自己过了一把瘾，更不用说这个“丑儿子”已被TapTap收录到“精品独立游戏”专题。对这段“特殊”的经历，紫烟君作了一个简单的分享。 菜鸟的自学手册：即兴发挥，善于借鉴其实制作《六芒花：隐秘潜入》与《太空甩枪舰》都是偶然，是我脑子一热就把学习作业给发布出来了。 我从小喜欢游戏，本身也从事游戏行业（虽然和游戏开发不沾边），但我做梦都想自己做游戏，撰写游戏剧情……可惜没有代码基础，平时又忙，于是只能着眼于最简单的文字游戏。 《六芒花：隐秘潜入》一开始就是为了学习测试蝶梦文字游戏编辑器而随手起的头，通过主站的教程大概学了五分钟就会用了。由于对潜入类游戏的喜爱，所以在掌握编辑器后一发不可收拾的把它写完了，基本是边写边构思，即兴发挥，一个礼拜收工。 《太空甩枪舰》…咳咳，它属于一个比《六芒花：隐秘潜入》更学习性质的小作品，这次是学习全新的图形游戏引擎——gamemei游戏魅可视化引擎，相比于文字游戏编辑器，这款引擎上限要高很多，所以一切从头开始，花了三天上手，边学边做。 由于找不到太多免费素材，于是用手头现有的素材结合最简单的玩法设计出来，学起来真的很累，不过因为是可视化不需要学太多代码。但构思大概只花了几分钟，其实是很厚颜无耻地把飞行射击和《是男人撑20秒》两种游戏机制结合了一下。 《六芒花：隐秘潜入》VS生命线：文字游戏该如何讲故事①节奏控制 《六芒花：隐秘潜入》是一款文字游戏，游戏背景建立于一个架空世界，在一个叫“六芒花”的神秘组织里，两人一组，负责后台指挥的叫先知，负责深入虎穴的叫猎手，而在游戏中玩家扮演的就是先知，负责帮助猎手出谋划策，完成一个调查药物公司的任务。 创造灵感来源于《杀手47》、《孤岛危机》、《看门狗》，但很多玩家认为，它与《生命线》更为相像，它有着非常类似于《生命线》的纯文字选项类玩法，玩家控制的先知给出的建议会决定猎手的路线，控制着剧情的走向，也将决定猎手的生死安危~ 《生命线》在文字游戏界的地位不言而喻，当我第一次接触到编辑器，我第一反应也是《生命线》，我觉得《六芒花：隐秘潜入》相比于它，最大的区别就是——《六芒花：隐秘潜入》比它短，没它那么好玩…… 好吧，自嘲一下，短和可玩性不足都是事实，但实际上和《生命线》最大的区别在于，我很刻意的摒弃了《生命线》中广为诟病的超长等待时间，其实《六芒花：隐秘潜入》全本字数也有18000字多，但玩起来非常快，原因就是我没有设置任何超过五秒以上的等待，将游戏的节奏尽可能加快，虽然玩通只要几分钟，但只求玩家姥爷通的过程是爽快的，而不是磨耐心。 ②扬长避短，另辟蹊径 相较于视频游戏，文字游戏在表现力上有着天然的弱势，我曾经是全职的网络小说写手，所以我能够有自信奉献给玩家的，大部分还是剧情和设定，希望能够在玩的过程中得到一种阅读式的惯性和沉浸感。 作为玩家和作者，我更希望文案作者能够切身代入到角色中去设计对话和分支选项，故事可以天马行空，但人设千万不能崩坏，不要想当然的用“我觉得”去定义一个角色，角色都是活的，要让自己去跟着角色思考，让角色自己说话。 （这里就不点名批评某负面例子，某知名文字游戏的二代，就有些想当然地去给女主角加戏删戏，各种强行打断玩家的反馈，体验至少让我非常不舒适……） 在《六芒花》的最初设定当中，其实盖恩和先知都是很模糊的形象，唯一确定的，是为了符合“猎手”只擅长行动的设定，盖恩要表现的相对不那么聪明，于是从这个“不聪明”这点上，延伸出了许多的性格特征，比如盖恩的判断力差，自恋，好脾气…而为了对应这些特征产生对白和剧情上的冲突点，先知（玩家）的性格设定就会偏向相反的方向——果断，毒舌，爱挖苦。 游戏中有许多选项其实是不会影响剧情走向的，这些选项存在的意义其实就是让玩家更好的代入进角色的性格，用对话来加强刻画盖恩的性格特点，想来这对于一款简陋到没有立绘的文字游戏而言还是很重要的…… 若要抛开“字”能解决的问题，就只能在美术，音乐，玩法上下功夫了。 美术和音乐已经见多不怪了，如何利用美术设计或音乐特效与文字游戏结合，使之更加分一些，这其中有很多门道，我玩《生命线》的时候就非常喜欢它对讲机式的界面设计。 《生命线》对讲机图 《六芒花：隐秘潜入》对讲机图 而玩法上，文字游戏不一定局限于“选项”这个互动点，我在《六芒花：隐秘潜入》中就尝试着加入了图形智力题以及一个考验发散思维的迷宫。这一点上我觉得我玩过做得最棒的，无疑是《Replica》。③善于设“局”上面说到迷宫的设置，这里就来详细地说一说。撇开我不要脸的参（chao）考（xi）门萨智力测试的那些题，《六芒花：隐秘潜入》中的蜂巢迷宫是完全我自己琢磨出来的玩法。最初的时候其实我是准备画一个蜂巢状的迷宫，设置一条正确路线和几条错误路线，然后将它完全转换为文字形式，这种玩法的效果十分类似于《最强大脑》中的蜂巢迷宫，考验的主要是立体思维和记忆力……然而后来放弃了，原因是这样的难度玩起来太难了，考虑到游戏整体的快节奏，我不希望出现在迷宫卡关卡一天的情况。 《最强大脑》蜂巢迷宫图 于是我换了个简单的思路，只要根据某个提示去理解，就可以畅通无阻的解开迷宫。在游戏中所给的提示是一串煞有其事的二进制代码，由1和0组成，其实对应的规律连小学知识都可以解开，1代表左，0代表右。随手写下一串1和0组成的提示后，我将正确的路线以一条顺序的逻辑线写了出来，但是由于编辑器不能设置同内容的选项，于是不能重复使用[左]和[右]作为选项文本，我就顺手在制作过程中将正确的路线每个选项搭配一个编号，依次为13579…至19，也就是所有单数按顺序代表了正确路线，反之的那条路用2-20标注，都是错误的路线。在错误的路线中，我将跳转打乱，但不设置跳转到最后一步的情况，于是只要走错到了错误的循环里，就会出现一种鬼打墙的错觉。后来测试的时候发觉，原本1-20的标注太明显了，比那个1和0的提示还要简单，所以为了混淆视听，把1-20交错打乱对应字母表的A-T，然后用字母来编号标注选项，一方面解决了选项文本重名的问题，另一方面也算扰乱了玩家的判断吧…… 《六芒花：隐秘潜入》迷宫最终设计图 对‘辣鸡游戏’也会抱有三分理解敬畏和宽容游戏之于我，往小了说是消遣和用爱发电，往大了说是一种积累和感恩。 但是游戏开发并不是一件简单的事，尤其是对于零基础的新手而言，下定决心做这么一件事确实需要更多的勇气和努力。《六芒花：隐秘潜入》的开发过程倒算是一帆风顺，然而在《太空甩枪舰》的开发中，开始用真正的图形游戏引擎就会发觉自己欠缺的实在太多了，最基础的代码思维就需要很长时间去培养。 有时候写个简单的逻辑会脑子卡壳想不出相应的触发规则头痛不已。再者缺乏经验导致很难直观的感受到1px大概是移动多远距离，2000ms大概是过了多久会触发，于是我在手感的优化上非常吃力…… 《太空甩枪舰》游戏截图 因为某些原因我平时接触过不少开发者，大到隐于市的大厂员工，小到刚出道的独立开发人，国内开发者不少是半路出家，没有专业的系统化的教学，更多是靠天分和热情去做游戏，这样弯路更多，做游戏的周期也就长了，更累，甚至很容易中途放弃热情。 通过亲身实践，我深知开发游戏的艰辛，此后我再玩到所谓的“辣鸡游戏”，也会抱有三分理解敬畏和宽容了。 最后苹果申请开发者太麻烦，所以《六芒花：隐秘潜入》暂无开发iOS版本的计划，有兴趣的同学可以到这里体验试玩： http://www.iwzyx.com/games/180 对于市场，我不抱有任何期待，因为我目前真的不打算（没自信）做商业游戏，本就是学习作品就不大言不惭的谈市场了吧…… 注：这篇文章是上网时无意间看到的，因为不可描述的原因，所以全文转载过来。本文来源：http://www.gameres.com/747850.html","categories":[{"name":"分享发现","slug":"分享发现","permalink":"https://www.berwyn.cn/categories/分享发现/"}],"tags":[{"name":"互动小说","slug":"互动小说","permalink":"https://www.berwyn.cn/tags/互动小说/"}]},{"title":"从设计到上线，如何运维一个新的网站","slug":"如何从零开始运维一个新的网站","date":"2017-06-15T11:01:38.000Z","updated":"2018-04-21T05:03:52.935Z","comments":true,"path":"2017/06/如何从零开始运维一个新的网站.html","link":"","permalink":"https://www.berwyn.cn/2017/06/如何从零开始运维一个新的网站.html","excerpt":"从大学至今陆续做了几个站，Wordpress、Discuz、PHPwind以及其他都有尝试过，总的来说还是够用的。 可惜的是，都没有坚持下来，主要是因为没有特色，难以存活。 不过现在讲的不是以前这些失败品，而是简单说下如何设计一个产品，进行推广与后续运维。","text":"从大学至今陆续做了几个站，Wordpress、Discuz、PHPwind以及其他都有尝试过，总的来说还是够用的。 可惜的是，都没有坚持下来，主要是因为没有特色，难以存活。 不过现在讲的不是以前这些失败品，而是简单说下如何设计一个产品，进行推广与后续运维。 一、设计与实现阶段1 先确定自身产品的定位，可以使用 Mindmanager 整理好思维导图，这样做产品原型时会事半功倍。 2 大概知道会做成什么样后，可以使用 Axure 或者 Sketch 设计产品原型，只需要个大概的 Demo ，方便交给技术人员做出来。如果精益求精做出互动效果来，那是更好的了。 3 做好原型后，非技术人员可以联系外包了。我是在 V2EX 发布了外包需求，简单沟通对比了一下就确定了开发人员。 付款一般采取 3-4-3 ，这个阶段比较考验人心，能不能靠谱看运气。所以要有保障的话，可以去 Shixian.com 等三方交易平台，至于猪八戒那种已经知名的大平台，可能会聚集了一大批实习生工作的外包公司。 4 交付定金后，自己购买域名和服务器，技术就会开工了，这段时期经常联系沟通，确保是自己要的最终效果。 二、上线推广阶段在设计与实现产品或者更早前，应该就要知道自己的产品面对的是什么样的人群，这样才能有针对性的进行推广，避免时间与精力上的浪费。 上线推广可以分为两波： 1 主动推广：主动推广的意义在于，你在任何可以留信息的地方，发布产品上线信息，吸引关注。 手段包括不仅限于：QQ群、邮件、论坛、百度百科、百度知道、知乎、微博等，尽量选取高权重的大平台，而且要在有针对性的版块区域。 百度自家的产品：知道、经验、贴吧，权重是非常高的。其次就是简书与知乎，以及一些其他的大站。 2 被动推广: 这一块主要是网站自身基础，比如网站关键词、网站地图、站点内容等。 有内容会吸引游戏驻留与注册，以及提升搜索引擎收录量。 SEO则是精准获取用户，毕竟用户使用搜索引擎的时候，只能搜关键词。 三、日常运维当开始有用户后，可以在其中选取协管人员，解放自己的工作量，从而有时间去做更重要的事情。 YY的创始人李学凌讲过一组用户画像：如果我有一片草地，我就在我的草地上养羊，所以我先要有第一只羊。如果这一只羊能够在我的草地上活下来，玩得很好，那么我的草地就是没问题的，我就可以引入更多的羊。羊多了，你就会发现头羊才是关键的，为什么呢？因为一只头羊可以管一大堆羊，你就不用管了，那些小羊就不用管了，头羊都会管。只要有头羊，羊群就可以聚集。羊多了就会有狼，狼多了，我就把羊圈起来，然后向狼收费。PS：收费之后呢，狼的需求是什么？狼以为收了费就能吃羊，实际上只能闻闻羊味，然后闻上瘾了持续付费！ 总结就是：a.产品好，种子用户才活得下去b.学会用流量变现c.管理KOL 这个在亲身实践后，确实效果很不错，所有的反馈都被协管过滤了一遍，有更多的时间与精力去完善产品。 ······ 路漫漫其修远兮，吾将上下而求索。","categories":[{"name":"产品运营","slug":"产品运营","permalink":"https://www.berwyn.cn/categories/产品运营/"}],"tags":[{"name":"产品设计","slug":"产品设计","permalink":"https://www.berwyn.cn/tags/产品设计/"},{"name":"网站运营","slug":"网站运营","permalink":"https://www.berwyn.cn/tags/网站运营/"}]},{"title":"快速使用Jekyll-now在Github搭建博客","slug":"快速使用Jekyll-now在Github搭建博客","date":"2017-06-13T02:17:29.000Z","updated":"2018-04-21T06:41:01.101Z","comments":true,"path":"2017/06/快速使用Jekyll-now在Github搭建博客.html","link":"","permalink":"https://www.berwyn.cn/2017/06/快速使用Jekyll-now在Github搭建博客.html","excerpt":"本来想学会用Jekyll和Hexo在Github搭建博客的，然后不出意外的困在本地部署上了。 再然后瞎搜了搜，就发现了可以在线编辑的利器 —— Jekyll-now ! 不过…… 通过勤查苦试我还是学会了 Hexo ，所以分享下吧，也许有人需要呢。","text":"本来想学会用Jekyll和Hexo在Github搭建博客的，然后不出意外的困在本地部署上了。 再然后瞎搜了搜，就发现了可以在线编辑的利器 —— Jekyll-now ! 不过…… 通过勤查苦试我还是学会了 Hexo ，所以分享下吧，也许有人需要呢。 Jekyll-now主要功能： 响应式以及移动客户端优化的主题 Markdown 支持 语法高亮 集成 Disqus 评论 集成 Google Analytics 统计 底部提供 SVG 格式的社会化图标 极少的 http 请求 无需安装依赖 无需设置本地开发环境 无需配置插件 无需花费时间在主题上 Jekyll-now部署步骤： 前往 Jekyll-now Fork项目 ； 在设置里将项目名称改为 yourgithubusername.github.io ，如：berwyns.github.io ； 在 _config.yml 文件里修改博客名称、描述以及头像 ； 开始访问你的博客，yourgithubusername.github.io 。 为什么写这篇文章？因为网上教使用Jekyll-now搭建博客的中文教程屈指可数，这么好的引流材料为什么不用呢？ 突然感觉自己很机智，SEO意识666~~~","categories":[{"name":"分享创造","slug":"分享创造","permalink":"https://www.berwyn.cn/categories/分享创造/"}],"tags":[{"name":"Jekyll","slug":"Jekyll","permalink":"https://www.berwyn.cn/tags/Jekyll/"},{"name":"Github","slug":"Github","permalink":"https://www.berwyn.cn/tags/Github/"}]},{"title":"此生与你相逢，实是三生有幸！","slug":"此生与你相逢，实是三生有幸！","date":"2016-12-15T06:37:19.000Z","updated":"2018-04-21T04:37:19.252Z","comments":true,"path":"2016/12/此生与你相逢，实是三生有幸！.html","link":"","permalink":"https://www.berwyn.cn/2016/12/此生与你相逢，实是三生有幸！.html","excerpt":"一次公众号的采访，虐狗的那种。","text":"一次公众号的采访，虐狗的那种。","categories":[{"name":"分享发现","slug":"分享发现","permalink":"https://www.berwyn.cn/categories/分享发现/"}],"tags":[{"name":"微信公众号","slug":"微信公众号","permalink":"https://www.berwyn.cn/tags/微信公众号/"}]},{"title":"一个NPC的正常死亡报告","slug":"一个NPC的正常死亡报告","date":"2016-08-05T16:54:51.000Z","updated":"2018-05-08T15:23:40.819Z","comments":true,"path":"2016/08/一个NPC的正常死亡报告.html","link":"","permalink":"https://www.berwyn.cn/2016/08/一个NPC的正常死亡报告.html","excerpt":"我叫流氓甲，对于一个武侠RPG游戏中NPC来说，这实在是个再普通不过的称呼。","text":"我叫流氓甲，对于一个武侠RPG游戏中NPC来说，这实在是个再普通不过的称呼。 但是我觉得很无辜，我在平安镇上生活了这么多年，到目前为止没偷过一只鸡，没打过一次架，更没调戏过一个妇女，怎么就成流氓了呢？这分明是乱扣帽子嘛。 好在这世上挂羊头卖狗肉的事儿数不胜数，我即便真是顶着个狗头，也未必就比别人丢脸。所以这种问题不用深究，只要想通了就没事儿。 在《夕阳游侠传》这个游戏里，平安镇是一个微不足道的场景。 平安镇里，我是一个微不足道的NPC。根据剧情设计，游戏的主人公林阳将于某天经过我们这里，他会遇见我，然后……将我击毙。 对于林阳而言，这是他漫长冒险旅途中微不足道的一个小插曲；但对于我而言，这就是我的全部人生。 我经常坐在镇子东面一座破房子的屋顶上，遥望着通向远方的道路，在每次的日升日落之间，等待游戏主人公的到来。 这种生活如自来水一样平淡，今天和昨天相同，明天和今天一样；什么都不发生，而时间慢慢逝去。 在平安镇上还有很多人的生活和我类似。 比如王木匠长年累月地锯着一块奇形怪状的木板，村民乙一辈子就等着说一句“镇长家在东南方向”，而镇长多年如一日持之以恒地站在院子里摆弄一张根本拉不开的弓。 林阳的人生则丰富得多。他一出生就拜在名师门下，18岁那年踏入江湖；一路上拈花惹草，惹是生非，所到之处鸡飞狗跳。 我们知道武侠RPG的主人公总喜欢多管闲事，以至于屡屡让自己身处险境。而这小子总能在危急关头逢凶化吉，直到消灭最终BOSS，携如花美眷归隐山林。 老实说我觉得这种剧情既庸俗又无聊，但一个NPC的意见即便说出来又有谁会在乎？有的人生来就是主人公，有的人一辈子都是NPC，游戏的世界如此，真实世界里又有什么两样？ 关于这个我从不抱怨。所谓命运，就是那些你不喜欢但又无法改变的东西。记得镇长总是教育我们说，要顺着命运走，不要跟命运较劲儿。 在那位“伟大”美工的“创意”之下，我们镇子里有三条腿的马，铁丝一样的树木和没有黑眼球的村民，大概是因为NPC就只配这样生活。 最让我恼火的，是我住的房子连一扇门都没有。好几次我半夜回来，黑灯瞎火的看不见，一脚不稳就从窗口掉了下去，摔得鼻青脸肿。 我又不是贼，天天回自己的家还要走窗户，你说这算是怎么回事儿？ “伟大”美工叫米麻雷，住在北京西郊的一间地下室里。那个地方空气污浊，环境脏乱不堪。 过道的墙壁涂满油污和尿茧的痕迹，半空中的铁丝上永远吊着湿漉漉的短裤和胸罩，他从下面经过的时候，总要淋上一脑袋可疑的水。 作为一个“外地来京务工人员”，他还要随时应付联防队员的突袭检查，万一哪天证件没带齐就会很倒霉。 一个正常人在这种地方住上半年，纵然有峥嵘的雄心壮志也会被消磨干净，惟有深深的绝望残存在意识中。 米麻雷在工作的时候，一不留神想到这些，于是满腔悲愤之情涌上心头。 这时他的电脑屏幕上，就会出现一些很可怕的生物和一幢幢很不适合人类居住的建筑。 我们这些NPC就住在这样的建筑里，而且找不到任何去抱怨的地方。 赵猫鱼的一只眼睛盯着屏幕，另一只眼睛警惕盯着房间的门，他的耳朵密切关注着隔壁的动静，随时提防着有人破门而入。 这个时候他就像一个前苏联的克格勃特工，也像一个无照经营的水果贩子。他的老婆正在客厅打电话，跟女伴交换着最新的打折信息。 赵猫鱼悄悄打开电脑，准备玩一会儿《夕阳游侠传》。这个游戏他已经玩了大半年，却始终在第一关里转悠。 原因之一是里面曲折凶险的迷宫太多，他这个路痴总也走不通，经常是绕几个圈子就不知道自己身在何处。 原因之二是他老婆经常在他玩游戏的中途冲进房间，这个时候他只能迅速关掉电脑，装出正在背英语单词的样子来；而那个姑娘动作相当敏捷，以至于赵猫鱼根本来不及保存进度。 赵猫鱼在学校里上电脑课的时候也曾经偷偷摸摸地玩游戏，因为随时都在担心老师的检查，他觉得十分刺激。 那个时候他做梦都不会想到等他有了自己的房子，在自己家里玩游戏的时候，他依然会像个贼一样。 赵猫鱼知道在《夕阳游侠传》里有个流氓甲，总喜欢看着远方发呆，他的生命就这样一天天地过去。 而流氓甲并不知道有一个叫赵猫鱼的家伙，每天在北京城里灰头土脸地东奔西跑，心情和他的不相上下。 赵猫鱼走在海淀区那些七扭八歪的老胡同里的时候，经常感觉自己身处一个巨大的迷宫，他总在担心某一面墙壁的背后会突然跳出个怪物来，拦住他的去路。 我每天坐在屋顶上，眺望着远方，等待着林阳。和一起我等待的，是镇子上的少女阿秀。对她来说这种等待比我要有意义得多。 在那位风流倜傥的男主角到来的那一天，会有人在酒馆里调戏阿秀，然后我们的男主角挺身而出英雄救美。还有什么情节能比这更让一个涉世不深的小姑娘着迷的呢？ 等待林阳的那些日子里，我们是两个同样寂寞的人。刚开始的时候，不管我说什么，阿秀总是回答“剧情没有安排我和你对话”。 时间长了，她发现我虽然面貌凶悍，倒也不是坏人，偶尔也会和我聊聊天，打发多余的时光。她提起林阳的时候总是满怀憧憬，全然不顾我的感受。 “他怎么还不来呀？”“不知道。”“你说他会不会在路上被怪物给吃了？”“应该不会吧。”“等他杀你的时候，你多抵抗一会儿好不好？别让他太轻易得手。”“我试试看吧。” 我不知道我是否填补了阿秀的寂寞时光，对于我来说这些并没有特别的意义。 我们等的是同一个人，这个人对我来说意味着死亡；而对她，则意味着幸福。 “你吃不吃糖豆？”“不吃。”“来一个吧，可甜呢。”“都说了，不要。”“不吃拉倒！”“那，来一颗尝尝。”“才不给你！” 米麻雷和赵猫鱼的身边也有很多女孩子。那些女孩子不喜欢吃糖豆，她们只喜欢让男人带着去买高级化妆品或者房子。 五月初七，丁卯日，冲兔，煞东。宜祭祀，沐浴，理发，整手足甲。忌开市，入宅，出行，修造。 这一天对于林阳来说无足轻重，这是他浪漫冒险旅行中平常的一天。 而这一天对于我，流氓甲，非常重要。 我在清晨开始眼皮跳，两只眼睛一起跳。所以林阳出现在我面前的时候，我看到的是一个重影。 站在我面前的是一个晒得黑油油的高大健康的小伙子，他抬起头问蹲在屋顶的我。 “嘿，这里是平安镇吗？我来晚了。” 林阳的大背包里有无穷无尽的好东西，张家村的大黄杏，李家堡的风干咸鱼，冰峡谷的红草莓，都是他在邻近的村子里低价收购的，准备带到南方去卖个好价钱。 我估计这小子是RPG游戏史上最有经济头脑的主人公。 这一天对于中远电脑游戏公司的美工米麻雷和海淀区胡同保护办公室的干事赵猫鱼来说也非同一般。 米麻雷因为出门的时候没有随身携带暂住证被收容审查，当公司人事部门的领导带着3000元人民币把他“捞”出来的时候，他看到两个联防队员正押解着帮朋友贩卖盗版光盘的赵猫鱼走进派出所的大门。 米麻雷的眼睛被阳光晃得睁不开，脖子也被按得很疼，那一瞬间他觉得迎面而来的这个人丑陋无比，比他笔下的任何一个怪物NPC都难看。 曾经有很多的时候，赵猫鱼都希望自己是RPG世界中的一个角色。他在玩《夕阳游侠传》的时候很投入，在里面横冲直撞，为所欲为。 这个时候他总以为自己是林阳，是这个世界的主人公。 现在他站在派出所的院子里，身边都是高大威武的人民警察。和米麻雷一样，他的眼睛也被阳光晃得睁不开，脖子也被按得很疼。 这个时候他终于知道自己只是一个NPC，一个最微不足道的NPC！ 林阳这小子不愧为名门正派出身的高徒，武功很是了得，一招一式都显出深厚功底，但我在等他的这些年里也没闲着。 我的功夫都是野路子，出招全无规律可寻，也够他抵挡一阵儿。刚开始的时候我们势均力敌，双方打得都比较保守，谁也不敢贸然出击。 后来我慢慢摸清了他的套路，打起来就比较顺手了；而他则严守门户，破绽很少。 阿秀站在一旁，兴致勃勃地看着我们的较量。她以为这和镇子上那些小孩子的打仗游戏一样，没有人会受到伤害。 她不知道这是真正的生死相搏，在这场战斗结束的时候，我和林阳只能有一个人活着。 到傍晚的时候，我和林阳的较量已经持续了3个多小时。打了这么长的时间，我们都有些气力不足。我靠一口真气勉强挺住，而他全凭兜里的药物支撑。 我不知道他那屁兜里能装下多少东西，反正只要一快没血了他就掏出一粒药来吃。每一粒药都能帮他恢复大量体力，而在他吃药的时候我连口水都喝不上。 当林阳吞下最后一粒金创药的时候，流氓甲已经筋疲力尽。他的目光呆滞，肩膀酸痛，脚下的步法也开始变得凌乱。 他抬起头来看看天，那是月朗星稀的一片宁静。在已经过去的很多个晚上，他曾经这样地凝望夜空，猜测着自己的命运。 他从没有感觉天空像今夜这样遥不可及。那一瞬间，他觉得自己是一只小蚂蚁；而林阳，是一只巨大的脚丫子。 林阳在进补之后精神大振，手中的剑又一次挥起。而流氓甲再也无力招架，他站在原地摇晃几下，猝然倒在地上。这个时候没有音乐响起，也没有BOSS被击倒时的精美过场动画，更没有重要角色牺牲时主角的深情回忆，只有一个简陋的画面。 “击败流氓甲，获得金钱500，经验1000，糖豆一个。”“林阳升级了。”“林阳学会了‘龙行天下’。” 林阳擦了擦剑上的血，然后小心地把它放回鞘里。阿秀站在旁边，显得有些茫然。 等明天天亮，她将作为这个游戏的女主人公之一和林阳一起踏上新的冒险旅程；在他们两个人之间，会有很浪漫的故事发生。这一天她曾经期待了很久，但是这一刻，她有说不出的悲伤。 “我很抱歉。” 林阳看看流氓甲的尸体，摇了摇头。 “但你应该知道，RPG游戏不会有其它结局。” 作者自述：赵勖予，男性，北京某软件公司程序员。喜欢饺子和电脑麻将，支持北京国安足球队，其他就真没什么好说的了。","categories":[{"name":"分享发现","slug":"分享发现","permalink":"https://www.berwyn.cn/categories/分享发现/"}],"tags":[{"name":"NPC","slug":"NPC","permalink":"https://www.berwyn.cn/tags/NPC/"},{"name":"网络游戏","slug":"网络游戏","permalink":"https://www.berwyn.cn/tags/网络游戏/"}]},{"title":"往期原创诗歌词作品合集","slug":"往期原创诗歌词作品合集","date":"2015-12-30T16:00:00.000Z","updated":"2018-04-27T15:15:56.218Z","comments":true,"path":"2015/12/往期原创诗歌词作品合集.html","link":"","permalink":"https://www.berwyn.cn/2015/12/往期原创诗歌词作品合集.html","excerpt":"混迹原创歌词吧好几年，看着唐映枫他们一步步成为大拿，对比起来实在是感到惭愧。 挑了几首还算拿得出手的歌词，权且做个回忆吧，毕竟曾经也是个文艺少年。","text":"混迹原创歌词吧好几年，看着唐映枫他们一步步成为大拿，对比起来实在是感到惭愧。 挑了几首还算拿得出手的歌词，权且做个回忆吧，毕竟曾经也是个文艺少年。 城2011-06-17 城外小村 夜渐深 蝉鸣有几声清月一轮 对半分 夜色微偏冷谁守空门 手执灯 心中念何人梨花带雨 仍残留泪痕 村外小城 起华灯 繁景如初春街上行人 随处闻 嘻笑喧闹声谁醉红尘 与何人 笑共鸳鸯枕酒令智昏 竟疑山无棱 可能是写过的最有意境的一首，可当作诗，亦可成歌词。 没歌怎敢说心事2012-10-15 假使我唱歌也有动人时刻你可会听完 不至先离场 听到动情时也不禁会哼唱即便你所思 不似我所想 原谅我嘴笨整日好似哑巴只可借唱歌 将心事表达 若是飙到破音力竭到声沙请别太见怪 体会才深刻 不唱歌怎敢说心事话太多难免会矫情陈奕迅切至李克勤感慨又多几个新知己 没有歌怎么说心事未必全部都话你知可我只需你能明晓这首歌只为唱给你听 至少你不必再惊讶为何我会如此动情 心中常有千千结，此生无有一人解。 自问自答2012-01-02 会说几句情话 但已没人听 得不到表达埋藏得久了 渐渐在心里 开出了花 真爱就够了吗 若设身处地 还会赞同吗请先别回答 现在的你 还不是她 曾经说过的话 多少个永远 多少个爱她最后又有几句 时至今日 仍未有变化 爱情像理乱麻 若用错方法 就会弄砸最后才明白 恋爱不是过家家 忘掉说过的话 很多承诺 不必分真假最初越是感人 到最后越是伤人 是吗 忘掉爱过的她 世界很大 该重新出发该放的就放下 过去的都过去了 对吧 放不下的话 请假装忘了 好吗 应该是听完《喜帖街》后，稍有改动的填词。 垃圾桶2012-07-07 鸡毛蒜皮可丢进去抱怨牢骚照收不误甚至腹中酸臭苦水亦可一吐为快 平常适宜窝居角落不宜出现视线范围待到需要时候记起最好出现及时 若能被人所需要实在应引以自豪舍己为成就他人也勉强称得上是好 可你已不再安分妄图要临阵脱逃苦水若没地能倒想想他们该多苦恼 世界若是没了你该会变得多麼糟糕 具体的事情不记得啦，反正题材一直都没有限制。 关于·诗至今所作的诗都太轻狂，暂时就不放进来了，等哪天有兴致吧。","categories":[{"name":"分享创造","slug":"分享创造","permalink":"https://www.berwyn.cn/categories/分享创造/"}],"tags":[{"name":"原创作品","slug":"原创作品","permalink":"https://www.berwyn.cn/tags/原创作品/"},{"name":"诗词歌赋","slug":"诗词歌赋","permalink":"https://www.berwyn.cn/tags/诗词歌赋/"}]}]}